---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TilePerRow
source: html/df9bdd3c-e41f-d251-07a3-2a58e61c768d.htm
---
# Autodesk.Revit.DB.Visual.Tile.TilePerRow Property

The property labeled "Every" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TilePerRow { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" within the range of "0, 50".